# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Gary\Documents\PSoC Creator\Workspace01\Lab 4b.cydsn\Lab 4b.cyprj
# Date: Thu, 11 Feb 2016 21:13:06 GMT
#set_units -time ns
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 313 627} [list [get_pins {ClockBlock/udb_div_0}]]


# Component constraints for C:\Users\Gary\Documents\PSoC Creator\Workspace01\Lab 4b.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Gary\Documents\PSoC Creator\Workspace01\Lab 4b.cydsn\Lab 4b.cyprj
# Date: Thu, 11 Feb 2016 21:13:02 GMT
